load/jmeter/search-test.jmx

<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6">
<hashTree>
<TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Search API Load Test" enabled="true">
<stringProp name="TestPlan.comments">CipherSchools QA Assignment</stringProp>
</TestPlan>
<hashTree>

<ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="10 Users Load Test" enabled="true">
<stringProp name="ThreadGroup.num_threads">10</stringProp>
<stringProp name="ThreadGroup.ramp_time">10</stringProp>
<stringProp name="ThreadGroup.duration">60</stringProp>
<stringProp name="ThreadGroup.scheduler">true</stringProp>
</ThreadGroup>

<hashTree>

<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Search API Request" enabled="true">
<stringProp name="HTTPSampler.domain">with-bugs.practicesoftwaretesting.com</stringProp>
<stringProp name="HTTPSampler.path">/api/products/search</stringProp>
<stringProp name="HTTPSampler.method">GET</stringProp>
<stringProp name="HTTPSampler.queryString">q=hammer</stringProp>
</HTTPSamplerProxy>

<hashTree/>

</hashTree>

</hashTree>
</hashTree>
</jmeterTestPlan>